{
    "pages": [
        {
            "url": "http://sastreconsulting.com/",
            "timestamp": "20220625114820",
            "content": "Sastre Home About Services Contact New generation intelligence Sastre assists professional services, legal, and corporate clients with information on business risks and opportunities. We provide investigative services, and\n                assist in the resolution of disputes. Equipped with best-in-class OSINT Sastre’s industry-leading OSINT services benefit from our local embeddedness and use of the latest technology. A decentralised operating model makes\n                    hard-to-access local open sources available to us. Proprietary AI and automation tools, as well as the latest innovative search methods and a creative approach\n                    to fact-finding ensure each piece of the puzzle surfaces and slides into place. Working through networks Sastre’s HUMINT capabilities rely on continuous, extensive source development and maintenancework. We cultivate relationships with the leaders of tomorrow as\n                    well as today and benefit from broad access to local markets allowing us to understand context – and achieve success in targeted, narrowly-focused intelligence\n                    assignments. Present on the ground Our in-house team is present in 10 countries, across 4 continents; our 100+ house-trained analysts and investigators cover almost the entire globe. This global\n                    reach gives us access to a wealth of local sources, enables a strong connection with our network and ensures client success through timely, accurate, and\n                    actionable intelligence. Born digital Sastre’s suite of proprietary investigative software help our investigators process and trace patterns in large and disparate pools of data, delivering\n                    otherwise lost insight in due diligence, litigation support, and asset tracing assignments. Use of automation tools for certain kinds of investigative research\n                    allows Sastre to deliver quality intelligence efficiently. More efficient Sastre achieves efficiency through operating in a lean, flexible, and decentralised manner and through the integration of AI and automation tools into every\n                    aspect of our work. This means we can offer premium investigative services at affordable rates.",
            "snapshot_url": "https://web.archive.org/web/20220625114820/http://sastreconsulting.com/"
        },
        {
            "url": "http://sastreconsulting.com/about.html",
            "timestamp": "20220625111732",
            "content": "About | Sastre Home About Services Contact The Sastre team brings to the table over 80 years’ combined experience from the private intelligence world, as well as the European and national public sectors and international organisations. Members of the team have been selected for their outstanding analytical prowess and trained in open-source and human intelligence techniques. Management Tamas Szabo, Partner Tamas co-founded Sastre in 2018. He is a specialist in open-source intelligence gathering and applies his skills in complex multi-jurisdictional investigations. Prior to Sastre, Tamas worked for several leading corporate intelligence firms in London. Tamas is a graduate of University College London. He is fluent in English, Hungarian, German and Russian. Andras Radnoti, Partner Andras co-founded Sastre in 2018 and is a director of the company. He manages sensitive intelligence assignments with a human intelligence component and leads\n                      Sastre’s network development efforts. Prior to Sastre, Andras worked for several leading UK political risk consultancies. He is specialised\n                        in the politics and economics of Eastern and Central and Eastern European countries. Andras is a graduate of the London School of Economics. He speaks English, Hungarian, Russian,\n                          Spanish, German, and French. Domonkos Szabo, Partner Domonkos co-founded Sastre in 2018. He serves as the company’s CFO and CTO, and takes a leading role in the development of its\n                      technological infrastructure. Prior to Sastre, Domonkos worked as a developer for a leading UK ed-tech company, and built and\n                      led a successful knowledge industry business in Budapest. Team Erno Buzas Bucharest Erno joined Sastre in 2018 and currently works as a research analyst on investigations of all kinds. Prior to Sastre, Erno worked as an investigative journalist. Erno is a graduate of Babes-Bolyai University in Cluj, Romania. He is fluent in English, Romanian\n                      and Hungarian. Erno joined Sastre in 2018 and currently works as a research analyst on investigations of all kinds. Prior to Sastre, Erno worked as an investigative journalist. Erno is a graduate of Babes-Bolyai University in Cluj, Romania. He is fluent in English, Romanian\n                    and Hungarian. Pascal Cisse Moscow Pascal joined Sastre in 2018 and currently manages complex investigations. Prior to Sastre, he served as an officer at a major multilateral bank and acquired experience\n                      teaching English in Russia. Pascal is a graduate of the University of Bath. He speaks English, French, Russian and Spanish. Pascal joined Sastre in 2018 and currently manages complex investigations. Prior to Sastre, he served as an officer at a major multilateral bank and acquired experience\n                    teaching English in Russia. Pascal is a graduate of the University of Bath. He speaks English, French, Russian and Spanish. Andrej Hagan Prague Andrej joined Sastre in 2018 and currently manages accounts within its due diligence practice. Prior to Sastre, he worked as a political science researcher. Andrej is a graduate of the Central European University. He speaks English, Czech, French and Russian. Andrej joined Sastre in 2018 and currently manages accounts within its due diligence practice. Prior to Sastre, he worked as a political science researcher. Andrej is a graduate of the Central European University. He speaks English, Czech, French and Russian. Rajshekhar Rao Lanka Mumbai Raj joined Sastre in 2021. He conducts policy research and due diligence investigations worldwide. Prior to Sastre, Raj completed legal internships at various consulting and technology firms in\n                      Southeast Asia. He is a graduate of the Government Law College in Mumbai. Raj joined Sastre in 2021. He conducts policy research and due diligence investigations worldwide. Prior to Sastre, Raj completed legal internships at various consulting and technology firms in\n                    Southeast Asia. He is a graduate of the Government Law College in Mumbai. James Drayton-Losotov Vienna James joined Sastre in 2019. He currently manages complex investigations, having earlier run\n                      teams of analysts working on global policy research projects. Prior to Sastre, James was an officer at a major multilateral organisation and gained experience\n                      conducting political and policy research in the not-for-profit sector. James is a graduate of the University of Tartu. He is fluent in English, Russian, German and French. James joined Sastre in 2019. He currently manages complex investigations, having earlier run\n                    teams of analysts working on global policy research projects. Prior to Sastre, James was an officer at a major multilateral organisation and gained experience\n                    conducting political and policy research in the not-for-profit sector. James is a graduate of the University of Tartu. He is fluent in English, Russian, German and French. Samridhi Malhotra Bengaluru Samridhi joined Sastre in 2022. She currently works as executive and project assistant within the\n                      firm. Prior to Sastre, she worked in HR roles at various marketing and IT companies in India. Samridhi is a graduate of the University of Delhi. Samridhi joined Sastre in 2022. She currently works as executive and project assistant within the\n                    firm. Prior to Sastre, she worked in HR roles at various marketing and IT companies in India. Samridhi is a graduate of the University of Delhi. Yuliia Parkhomenko Budapest Yuliia joined Sastre in 2022. She assists research and project execution across the firm’s political risk, \n                      policy research, and corporate intelligence practices. Prior to Sastre, she conducted internships at various Ukrainian and international foreign think tanks. Yuliia is completing her MA in Central and East European, Russian and Eurasian studies at the University of Glasgow (UK). \n                      She speaks English, Ukrainian, Russian, French and Hungarian. Yuliia joined Sastre in 2022. She assists research and project execution across the firm’s political risk, \n                    policy research, and corporate intelligence practices. Prior to Sastre, she conducted internships at various Ukrainian and international foreign think tanks. Yuliia is completing her MA in Central and East European, Russian and Eurasian studies at the University of Glasgow (UK). \n                    She speaks English, Ukrainian, Russian, French and Hungarian. Giulia Pieroni Nairobi Giulia joined Sastre in 2021. She conducts due diligence and corporate investigations applying both\n                      open-source and human intelligence techniques. Prior to Sastre, Giulia worked as a due diligence investigator for several leading consultancies. She\n                      also served as corporate relations executive at an East African security company. Giulia is a graduate of the University of Bath. She speaks English, French and Italian. Giulia joined Sastre in 2021. She conducts due diligence and corporate investigations applying both\n                    open-source and human intelligence techniques. Prior to Sastre, Giulia worked as a due diligence investigator for several leading consultancies. She\n                    also served as corporate relations executive at an East African security company. Giulia is a graduate of the University of Bath. She speaks English, French and Italian. Niels Wildschut Vienna Niels joined Sastre in 2021 and currently manages its global policy research projects. Prior to Sastre, Niels was a research fellow within an ERC-funded international research project. Niels obtained his PhD from the University of Vienna, and has published various academic articles. \n                      He speaks English, Dutch and German. Niels joined Sastre in 2021 and currently manages its global policy research projects. Prior to Sastre, Niels was a research fellow within an ERC-funded international research project. Niels obtained his PhD from the University of Vienna, and has published various academic articles. \n                    He speaks English, Dutch and German. Zsuzsa Buzas Budapest Zsuzsa joined Sastre in 2021 and serves as the firm’s office manager. Prior to Sastre, Zsuzsa had administrative and management roles at various Hungarian government\n                      agencies and the central bank. Zsuzsa joined Sastre in 2021 and serves as the firm’s office manager. Prior to Sastre, Zsuzsa had administrative and management roles at various Hungarian government\n                    agencies and the central bank.",
            "snapshot_url": "https://web.archive.org/web/20220625111732/http://sastreconsulting.com/about.html"
        },
        {
            "url": "http://sastreconsulting.com/contact.html",
            "timestamp": "20220625105911",
            "content": "Sastre | Contact Home About Services Contact",
            "snapshot_url": "https://web.archive.org/web/20220625105911/http://sastreconsulting.com/contact.html"
        },
        {
            "url": "http://sastreconsulting.com/robots.txt",
            "timestamp": "20220625103554",
            "content": "404 Not Found Not Found The requested URL was not found on this server. Additionally, a 404 Not Found\nerror was encountered while trying to use an ErrorDocument to handle the request.",
            "snapshot_url": "https://web.archive.org/web/20220625103554/http://sastreconsulting.com/robots.txt"
        },
        {
            "url": "http://sastreconsulting.com/services.html",
            "timestamp": "20220625103554",
            "content": "Services | Sastre Home About Services Contact Due Diligence We conduct comprehensive pre-transaction background investigations on prospective partners, third-party intermediaries and their key principals in order to help identify undisclosed liabilities, such as regulatory issues, significant litigation matters, conflicts of interest, media controversies or political exposure. Our due diligence screenings are supported by intimate knowledge of our markets, sophisticated, latest-technology OSINT, and vast established in-country source networks. Recent highlight: By interviewing one subject’s competitors, we developed a thorough understanding of the mechanisms, traditions and true scale of corrupt practices in the real estate\n              sector of a district in a major European city. Using open sources, we successfully linked the subject’s deals to high-risk individuals identified by our human\n              sources. Strategic Intelligence Corporate, investor, and professional services clients seek our services to gather in-depth intelligence on market opportunity, competitor strategy, and regulator attitudes to inform business strategy. Drawing on both open sources (i.e. archived versions of websites, industry rumours, employee opinions, domain and patent registration practices, hiring patterns, leaked data, etc.) and human sources (industry and insider), Sastre is in a position to paint a detailed picture of a subject’s past activities and future intentions. Recent highlight: We found a source with knowledge of incriminating information about the executive of a cryptocurrency startup on a defunct topical forum unindexed by Google and\n              successfully interviewed him. After identifying the source’s legal name with the help of information about his username leaked to the dark web, we used an array of\n              semi-automated open source intelligence methods to identify his current contact details. Asset Tracing Insolvency practitioners and professional services firms come to us for help with the discovery of individuals’ and companies’ hidden assets. Our investigators also assist clients by locating potential witnesses and examining their credentials or conflicts of interest for current or anticipated proceedings. Recent highlight: We assisted a major consultancy on a multi-month asset trace across a number of jurisdictions. Using a combination of on-the-ground and open source investigation, we\n              successfully identified a subject’s companies, bills of lading, properties and vehicles, including some held on his behalf by appointed nominees to conceal ownership. Litigation Support Litigators and other professional services clients seek our help in supporting litigation and arbitration through expert investigation of counterparty objectives, strategies, and backgrounds. Depending on the case, we use open-source expertise and human assets to obtain intelligence and/or evidence to settle cases in clients’ favour. Recent highlight: Using our understanding of the unique regulatory framework for factoring and forfaiting in Slovakia, we reconstructed the likely method used by a subject to funnel\n              funds from a Russian company. Examining the online footprints of the companies party to the transaction, we confirmed the involvement of fraudulent actors and their\n              undisclosed links to the subject.",
            "snapshot_url": "https://web.archive.org/web/20220625103554/http://sastreconsulting.com/services.html"
        }
    ],
    "metadata": {
        "domain": "",
        "date": "250622",
        "source": "commoncrawl",
        "is_domain_wide": true,
        "total_pages": 5
    }
}