{
  "urls": [
    {
      "url": "http://sastreconsulting.com/services.html",
      "text": "Services | Sastre Home About Services Contact Due Diligence We conduct comprehensive pre-transaction background investigations on prospective partners, third-party intermediaries and their key principals in order to help identify undisclosed liabilities, such as regulatory issues, significant litigation matters, conflicts of interest, media controversies or political exposure. Our due diligence screenings are supported by intimate knowledge of our markets, sophisticated, latest-technology OSINT, and vast established in-country source networks. Recent highlight: By interviewing one subject’s competitors, we developed a thorough understanding of the mechanisms, traditions and true scale of corrupt practices in the real estate\n              sector of a district in a major European city. Using open sources, we successfully linked the subject’s deals to high-risk individuals identified by our human\n              sources. Strategic Intelligence Corporate, investor, and professional services clients seek our services to gather in-depth intelligence on market opportunity, competitor strategy, and regulator attitudes to inform business strategy. Drawing on both open sources (i.e. archived versions of websites, industry rumours, employee opinions, domain and patent registration practices, hiring patterns, leaked data, etc.) and human sources (industry and insider), Sastre is in a position to paint a detailed picture of a subject’s past activities and future intentions. Recent highlight: We found a source with knowledge of incriminating information about the executive of a cryptocurrency startup on a defunct topical forum unindexed by Google and\n              successfully interviewed him. After identifying the source’s legal name with the help of information about his username leaked to the dark web, we used an array of\n              semi-automated open source intelligence methods to identify his current contact details. Asset Tracing Insolvency practitioners and professional services firms come to us for help with the discovery of individuals’ and companies’ hidden assets. Our investigators also assist clients by locating potential witnesses and examining their credentials or conflicts of interest for current or anticipated proceedings. Recent highlight: We assisted a major consultancy on a multi-month asset trace across a number of jurisdictions. Using a combination of on-the-ground and open source investigation, we\n              successfully identified a subject’s companies, bills of lading, properties and vehicles, including some held on his behalf by appointed nominees to conceal ownership. Litigation Support Litigators and other professional services clients seek our help in supporting litigation and arbitration through expert investigation of counterparty objectives, strategies, and backgrounds. Depending on the case, we use open-source expertise and human assets to obtain intelligence and/or evidence to settle cases in clients’ favour. Recent highlight: Using our understanding of the unique regulatory framework for factoring and forfaiting in Slovakia, we reconstructed the likely method used by a subject to funnel\n              funds from a Russian company. Examining the online footprints of the companies party to the transaction, we confirmed the involvement of fraudulent actors and their\n              undisclosed links to the subject.",
      "timestamp": "20220526140250"
    }
  ],
  "metadata": {
    "domain": "sastreconsulting.com",
    "date": "260522",
    "source": "commoncrawl",
    "is_domain_wide": false
  }
}